<?php
/*司机工号　身份证号
 * 车辆id　车牌号
 *count 均为统计数据总条数　用于分页
 */

/*
 *$type "司机" 或者 "车辆"
 *$date 日期   "Y-m-d"
 *根据日期返回 汽车或者司机的 日期最近10周的危险分数统计数据 根据登陆者的身份统计
 *$weekcount 默认最近10周 		统一数组越下面　越靠近$date
 */
function driver_statistics($type, $date, $weekcount = 10) {
//
	return array(
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 312),
		array("起始日期" => "111", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
		array("起始日期" => "", "终止日期" => "", "安全分数" => 312),
	);
}
/*
 *$id 司机id 查询该司机的近10周信息以及本周内的统计 可翻页查询以前的
 *count 为统计司机起始到终止日期的数据总条数
 */
function single_driver_statistics($id, $page) {
	//单个司机 每页１０行
	return array("rank" => array(
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 200, "排名" => 20),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 230, "排名" => 50),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 180, "排名" => 35),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 190, "排名" => 88),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 235, "排名" => 108),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 210, "排名" => 82),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 200, "排名" => 64),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 230, "排名" => 30),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 200, "排名" => 50),
		array("起始日期" => "111", "终止日期" => "111", "安全分数" => 160, "排名" => 19),
	), //最近10周数据
		"count" => 50, //返回该数据集共多少行
		"daylist" => array(
			array("星期" => "星期一", "司机名" => "司机名", "里程" => 538, "FCW" => 538, "PCW" => 28, "急加速" => 10, "急减速" => 5, "危险总分" => 43),
			array("星期" => "星期一", "司机名" => "司机名", "里程" => 538, "FCW" => 538, "PCW" => 28, "急加速" => 10, "急减速" => 5, "危险总分" => 43),
			array("星期" => "星期一", "司机名" => "司机名", "里程" => 538, "FCW" => 538, "PCW" => 28, "急加速" => 10, "急减速" => 5, "危险总分" => 43),
			array("星期" => "星期一", "司机名" => "司机名", "里程" => 538, "FCW" => 538, "PCW" => 28, "急加速" => 10, "急减速" => 5, "危险总分" => 43),
			array("星期" => "星期一", "司机名" => "司机名", "里程" => 538, "FCW" => 538, "PCW" => 28, "急加速" => 10, "急减速" => 5, "危险总分" => 43),
		), //本周从周日到今天的数据
	);
}
/*
 *$type 司机或者车辆
 *$date 日期
 *$id 司机或着车辆id
 *返回 日期内司机或者车辆的仪器统计的详细信息
$date1, $date2 起始日期和终止日期
 */
function type_explain($type, $date1, $date2, $id) {
//司机或者车辆
	return array(
		"姓名" => "姓名或者车辆名",
		"单位" => "单位",
		"时间段" => "时间段",
		"危险分数" => "危险分数",
		"排名" => "排名",
		"危险级别" => "危险级别",
		"刹车等级" => 3.5,
		"急刹车等级" => 3.5,
		"加速等级" => 5,
		"急加速等级" => 5,
		"急转弯等级" => 1,
		"急换道等级" => 5,
		"超速等级" => 1,
		"碰撞等级" => 5,
		"Mobileye HW" => 3.5,
		"Mobileye FCW" => 4,
		"Mobileye LDWR" => 1,
		"Mobileye LDWL" => 0.5,
	);
}
/*$stage 级别 从集团到司机
 *$date1  起始日期
 *$date2 终止日期
 *$id  对应级别id
 *$case 案例 比如急加速
 *地图左边信息 返回的是司机驾车 某一事件类型发生的地图描述
 */
function map($stage, $date1, $date2, $id, $case) {
	return array(
		array("时间" => "时间", "司机" => "司机", "速度" => "速度", "车牌号" => "车牌号", "事件类型" => "事件", "事件详细" => "事件详细", "lng" => "坐标", "lat" => "坐标"),
		array("时间" => "时间", "司机" => "司机", "速度" => "速度", "车牌号" => "车牌号", "事件类型" => "事件", "事件详细" => "事件详细", "lng" => "坐标", "lat" => "坐标"),
		array("时间" => "时间", "司机" => "司机", "速度" => "速度", "车牌号" => "车牌号", "事件类型" => "事件", "事件详细" => "事件详细", "lng" => "坐标", "lat" => "坐标"),
	);
}
/*
 *$type 司机或者车辆
 *$id  司机id
 *$page 页码
 *返回司机或者车辆的历史统计数据 以月份为单位
 */

function driver_history($type, $id, $page) {
//司机或者车辆
	return array(
		"data" => array(
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300)),
		"count" => 30,
	); //count为总条数
}
/*
 *$type 司机或者车辆
 *$id  司机id
 *$page 页码
 *返回选定日期内司机或者车辆的事件类型的占比
 */
function driver_percent($type, $date1, $date2, $id) {
//司机或者车辆
	return array(
		array("事件类型" => "事件类型", "事件占比" => 25.0),
		array("事件类型" => "事件类型", "事件占比" => 25.0),
		array("事件类型" => "事件类型", "事件占比" => 25.0),
		array("事件类型" => "事件类型", "事件占比" => 25.0),
	);
}
//排出前5时段、路段、时段和路段
/*
 *$type 司机或者车辆
 *$category 事件类型 比如 FCW
$id 司机或者车辆ID
$date 哪一周
返回排名前5的 时段 路段 时段路段交集 以及相关消息
 */
function type_list($type, $date1, $date2, $category, $id) {
	return array(
		"路段" => array(
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数")),
		"时段" => array(
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数")),
		"路段和时段" => array(
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数")),
	);
}
/*
 *$type "车辆"或者"司机"
 *$id 相应id 车牌号或者司机工号
 * 返回司机或者车辆近10周整改趋势
 *$name 路段名 可能有
 *$time 时段名 	可能有
 */
function driver_trend($type, $id, $name, $time) {
	return array(
		array(
			"name" => "司机名", //车辆直接不返回　用的车牌号
		),
		array(
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 280),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 312),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 160),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 120),
		),
	);
}
/*
 *单位车辆平均危险趋势图
 *返回最历史统计单位车辆曲线图 要翻页
 *车辆的各种数据占比历史统计
 */
function secure_trend($page) {
	return array(
		array(
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 280),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 312),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 160),
			array("起始日期" => "111", "终止日期" => "111", "单位车辆平均危险分数" => 120),
		), array(
			array("事件类型" => "事件类型", "事件占比" => 25.0),
			array("事件类型" => "事件类型", "事件占比" => 25.0),
			array("事件类型" => "事件类型", "事件占比" => 25.0),
			array("事件类型" => "事件类型", "事件占比" => 25.0),
		),
		"count" => 50,
	);
}
/*
 *本月月司机安全风险排名以及绩效
 *返回 司机安全风险排名 以及绩效
 *count
 */
function drver_scresult($page) {
	return array(
		array(
			array("司机名" => "司机名", "危险分数" => 312, "排名" => 1, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 286, "排名" => 2, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 240, "排名" => 3, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 4, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 5, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 6, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 7, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 8, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 9, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注"),
			array("司机名" => "司机名", "危险分数" => 120, "排名" => 10, "升降" => 0, "安全奖标准" => "安全奖标准", "奖励比例" => 1, "实际奖励" => "实际奖励", "备注" => "备注")),
		"合计危险总分" => 10000, "count" => 50,
	);
}
/*
 *$date 日期
 *$page 分页
 *返回车辆排名  按照危险分数从高到低
 */
function car_rank($date1, $date2, $page) {
	return array(
		"count" => 40,
		"data" => array(
			array("车牌号" => 122, "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 11),
			array("车牌号" => 122, "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 11),
			array("车牌号" => 122, "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 11),
			array("车牌号" => 122, "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 11),
			array("车牌号" => 122, "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 11),
		),
	);
}
/*
 *$id车牌号
 *单辆车的信息统计 默认为最近10周 可翻页
 */
function single_car_statistics($id, $page) {
	return array(
		array(
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 200, "排名" => 20),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 230, "排名" => 50),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 180, "排名" => 35),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 190, "排名" => 88),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 235, "排名" => 108),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 210, "排名" => 82),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 200, "排名" => 64),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 230, "排名" => 30),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 200, "排名" => 50),
			array("起始日期" => "111", "终止日期" => "111", "安全分数" => 160, "排名" => 19),
		),
		array(
			array("日期" => "星期一", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
			array("日期" => "星期二", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
			array("日期" => "星期三", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
			array("日期" => "星期四", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
			array("日期" => "星期五", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
			array("日期" => "星期六", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
			array("日期" => "星期日", "里程" => 300, "FCW" => 300, "PCW" => 10, "急加速" => 10, "急减速" => 10, "危险总分" => 330),
		), //本周内
		array(
			array("司机工号" => 4, "司机名" => "司机一", "司机占比" => 20),
			array("司机工号" => 5, "司机名" => "司机二", "司机占比" => 40),
			array("司机工号" => 6, "司机名" => "司机三", "司机占比" => 15),
			array("司机工号" => 7, "司机名" => "司机四", "司机占比" => 15),
		),
		array("count" => 50)
		,
	);
}

/*
 *$id 汽车牌号
 *查询汽车的历史行驶和行车熄火比例
 *$date 时间
 *默认为最近一周的
 */
function car_use($id) {
	return array(array("行驶天数" => 50, "停驶天数" => 50), array("行车时间" => 30, "熄火时间" => 70));
}

/*
 *查询集团所有路线班次 $page 分页
 *id为该班次识别码
 */
function car_runtime($page) {
	return array(
		array(
			array("id" => 7, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 8, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 9, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 9, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 9, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 7, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 8, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 9, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 9, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 9, "线路" => "线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
		),
		"count" => 50,
	);

}
/*
 *查询集团所有路线异常班次 分页
 *id为该班次识别码
 */
function car_runtime_sp($page) {
	return array(
		array(
			array("id" => 12, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 13, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 14, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 14, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 14, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 12, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 13, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 14, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 14, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
			array("id" => 14, "原线路" => "原线路", "班次" => "班次", "运行时间" => "运行时间", "里程" => "里程", "平均速度" => "平均速度", "起点" => "起点", "途径" => "途径", "终点" => "终点", "出发时间" => "出发时间", "到达时间" => "到达时间", "明细" => "明细"),
		),
		"count" => 50,
	);
}
/*
 *查询有史以来的 排名前几的数据
 */
function road_run() {
	return array(
		array(
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
			array("路段名" => "路段名", "刹车次数" => 17),
		),
		array(
			array("路段名" => "路段名", "FCW次数" => 20),
			array("路段名" => "路段名", "FCW次数" => 18),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
			array("路段名" => "路段名", "FCW次数" => 10),
		),
		array(
			array("路段名" => "路段名", "PCW" => 27),
			array("路段名" => "路段名", "PCW" => 15),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
			array("路段名" => "路段名", "PCW" => 11),
		),
	);
}

/*
 * 大数据分析路段时段分析模块
 *返回各路段安全危险分数排名前5的
 */
function road_safe_road() {
	return array(
		array("路段名" => "路段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
	);
}
/*
 *$date 根据日期查询
 *返回各时段安全危险分数排名前5的
 */
function road_safe_time() {
	return array(
		array("时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
	);
}
/*
 *
 */
function road_safe() {
	return array(
		array("路段名" => "路段名", "时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
		array("路段名" => "路段名", "时段名" => "时段名", "各类消息" => "各类消息", "安全危险分数" => "安全危险分数"),
	);
}
/*
 *$cond array(
"时段"=> "时段名",
"路段"=> "路段名"
)
 *	时段与路段至少有一个
 *返回近10周数据 大数据分析路段时段分析模块 路段时段 均为由前三个接口传入
 */
function get_trend($cond) {
	return array(
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 312),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 286),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 240),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 300),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 280),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 312),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 286),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 240),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 160),
		array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 120),
	);
}

/*
 *根据传入等级 集团｜公司｜子公司｜车队｜线路
 *$id 当前等级id 进行查询
 *$page 分页页码
 *默认返回当前所查询的单位的近10周信息
 */
function securesch($stage, $id, $page) {
//传入等级：集团｜｜公司｜｜子公司｜｜车队...
	return array(
		array(
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 312),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 280),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 312),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 160),
			array("起始日期" => "111", "终止日期" => "111", "安全危险分数" => 120),
		),
		array(
			array("下级id" => 1, "下级名称" => 'a'),
			array("下级id" => 2, "下级名称" => 'b'),
			array("下级id" => 3, "下级名称" => 'c'),
		),
		"count" => 50,
	);
}
/*
 *$stage 归属 集团｜公司... $id 归属ID
 *$date 日期
 *$page 分页
 *返回当前所查询的单位的选定日期内司机的排名
 *数据条数 数据总条数
 */
function se_order($stage, $date1, $date2, $page, $id) {
	return array(
		array(
			array("司机工号" => "1", "司机名" => "司机名", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分", "排名" => 1),
			array("司机工号" => "1", "司机名" => "司机名", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分", "排名" => 1),
			array("司机工号" => "1", "司机名" => "司机名", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分", "排名" => 1),
			array("司机工号" => "1", "司机名" => "司机名", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分", "排名" => 1),
			array("司机工号" => "1", "司机名" => "司机名", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分", "排名" => 1),
		),
		"总分" => array("里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分"),
		"count" => 50,
	);

}

/*
 *$stage 归属 集团｜公司... $id 归属ID
 *$date 日期
 *$page 分页
 *返回当前所查询的单位的选定日期内车辆的排名
 */
function car_order($stage, $date1, $date2, $page, $id) {
//车辆排行 按照危险分数
	return array(
		array(
			array("车牌号" => "车牌号", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 1),
			array("车牌号" => "车牌号", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 1),
			array("车牌号" => "车牌号", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 1),
			array("车牌号" => "车牌号", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 1),
			array("车牌号" => "车牌号", "里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => 300, "排名" => 1),
		),
		"总分" => array("里程" => "里程", "FCW" => "FCW", "PCW" => "PCW", "急加速" => "急加速", "急减速" => "急减速", "危险总分" => "危险总分"),
		"count" => 50,
	);
}
/*
 *传入等级：集团｜｜公司｜｜子公司｜｜车队...
 *返回查询的单位危险分数历史汇总
 */
function stage_history($stage, $page, $id) {
//根据等级查询历史危险分数
	return
	array(
		array(
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
		),
		"count" => 50,
	);
}

/*
 *$stage 传入等级：集团｜｜公司｜｜子公司｜｜车队...
 *$date1 $date2 起始日期和终止日期
 *$id 当前ID
 *返回该单位各类事件危险分数占比
 */
function stage_percent($stage, $date1, $date2, $id) {
//根据等级查询事件类型占比
	return array(
		array("事件类型" => "事件类型", "事件占比" => 25.0),
		array("事件类型" => "事件类型", "事件占比" => 25.0),
		array("事件类型" => "事件类型", "事件占比" => 25.0),
		array("事件类型" => "事件类型", "事件占比" => 25.0),
	);
}

/*
 *$stage 传入等级：集团｜｜公司｜｜子公司｜｜车队...
 *$category 类型 fcw等
 *$id 当前ID
 *返回该单位危险分数前5的路段 时段 路段和时段
 */
function stage_type_list($stage, $category, $id) {
	return array(
		array(
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "消息" => "消息", "综合" => "总体分数"),
		),
		array(
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
		),
		array(
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
			array("路段名" => "路段名", "时段名" => "时段名", "消息" => "消息", "综合" => "总体分数"),
		),
	);
}
/*$stage 	集团｜公司　...
 *$typename　集团名｜公司名｜...
返回该公司或者集团id　以便使用
 */
function getstageid($stage, $typename) {
	return array("id" => 1);
}

/*
 *$type  array(
"时段"＝>"时段名"，
"路段"＝>"路段名"
)
 *返回单位近10周的某$type某$category发生的趋势数据 近10周的
 */
function stage_trend($stage, $id, $type) {
//等级 路段
	return array(
		array(
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 312),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 280),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 300),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 312),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 286),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 240),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 160),
			array("起始日期" => "111", "终止日期" => "111", "危险分数" => 120),
		),
		"count" => 50, //总数
	);
}

/*
 *$date 选定日期查询该天所在周 默认为最近一周　$date "Y-m-d"
 *返回时间内可能事故的统计以及相关信息
 */
function accident($date) {
	return array(
		array(
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "视频url" => "视频", "速度降幅" => "速度降幅"),
		),
		"count" => 50,
	);
}

/*
 *$date 选定日期进行查询 默认为最近一周
 *返回时间内疲劳驾驶的统计信息
 */
function drive_sleepy($date) {
	return array(
		array(
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "时长" => "时长"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "时长" => "时长"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "时长" => "时长"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "时长" => "时长"),
			array("司机id" => 1, "司机名" => "司机名", "车牌号" => "车牌号", "时间" => "时间", "地点" => "地点", "时长" => "时长"),
		),
		"count" => 50,
	);
}
/*
 *$date 选定日期进行查询 否则默认为最近一周
 *返回日期内设备故障的统计信息
 */
function device_warn($date) {
	return array(
		array(
			array("车牌号" => "车牌号", "故障代码" => "故障代码", "发生地点" => "发生地点", "发生时间" => "发生时间", "处理人" => "处理人", "处理结果" => "处理结果", "处理时间" => "处理时间"),
			array("车牌号" => "车牌号", "故障代码" => "故障代码", "发生地点" => "发生地点", "发生时间" => "发生时间", "处理人" => "处理人", "处理结果" => "处理结果", "处理时间" => "处理时间"),
			array("车牌号" => "车牌号", "故障代码" => "故障代码", "发生地点" => "发生地点", "发生时间" => "发生时间", "处理人" => "处理人", "处理结果" => "处理结果", "处理时间" => "处理时间"),
			array("车牌号" => "车牌号", "故障代码" => "故障代码", "发生地点" => "发生地点", "发生时间" => "发生时间", "处理人" => "处理人", "处理结果" => "处理结果", "处理时间" => "处理时间"),
			array("车牌号" => "车牌号", "故障代码" => "故障代码", "发生地点" => "发生地点", "发生时间" => "发生时间", "处理人" => "处理人", "处理结果" => "处理结果", "处理时间" => "处理时间"),
		),
		"count" => 50,
	);
}
/*
 *$time 时间
 *返回日期内超速的统计 前10
 */
function distant_speed_anasis($time) {
	return array("大于100" => array(
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 10),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 9),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 8),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 7),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 6),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 5),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 4),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 3),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 2),
		array("司机工号" => 1, "司机" => "司机", "超速次数" => 1),
	),
		"小于100" => array(
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 10),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 9),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 8),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 7),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 6),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 5),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 4),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 3),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 2),
			array("司机工号" => 1, "司机" => "司机", "超速次数" => 1),
		),
	);
}
/*
 *$stage 级别  name: '待速时长占跟总运行时长比例',
data: [ 0.5, 0.5, 0.40, 0.38, 0.33, 0.34, 0.28,0.25, 0.25,0.21,]
}, {
name: '急加速次数',
data: [18.6, 17.9, 17.0,13.5, 14.3, 8.4,  3.5, 1.0,0.9, 0.6,]
}, {
name: '刹车里程跟总运行里程比例',
data: [ 17.0, 16.6, 15.2, 14.2,  11.9, 8.5,  5.7,4.8,3.9, 4.2,]
}, {
name: '分公司安全危险分数',
data: [ 17.0, 16.6, 15.2, 14.2,  11.9, 8.5,  5.7,4.8,3.9, 4.2,]
}]
 *$id 	对应id
 *返回日期内 单位的油耗及其相关信息
 */
function oil_init($stage, $id, $page) {
	return array(
		array(
			array("月份" => "2015-07", "油耗" => 9, "怠速" => 0.5, "急加速" => 18, "刹车" => 17, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 5, "怠速" => 0.5, "急加速" => 17, "刹车" => 16, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 6, "怠速" => 0.40, "急加速" => 17, "刹车" => 15, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 5.5, "怠速" => 0.38, "急加速" => 13, "刹车" => 11, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 8, "怠速" => 0.33, "急加速" => 11, "刹车" => 11, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 7, "怠速" => 0.34, "急加速" => 10, "刹车" => 8, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 6, "怠速" => 0.28, "急加速" => 9, "刹车" => 11, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 6, "怠速" => 0.25, "急加速" => 7, "刹车" => 17, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 6, "怠速" => 0.25, "急加速" => 7, "刹车" => 10, "安全危险分数" => 300),
			array("月份" => "2015-07", "油耗" => 5, "怠速" => 0.21, "急加速" => 6, "刹车" => 10, "安全危险分数" => 300),
		),
		"count" => 70,
	);
}
/*$stage 当前级别
 *$id 级别id
 *查询下一级别的油耗信息
 *返回日期内 单位的油耗及其相关信息
 */
function get_soncompany($stage, $id) {
//为集团时子公司改为分公司
	return array(
		array("id" => 1, "下级名" => "下级名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "本月加油量" => 4, "本月油耗" => 5),
		array("id" => 2, "下级名" => "下级名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "本月加油量" => 5, "本月油耗" => 6),
		array("id" => 3, "下级名" => "下级名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "本月加油量" => 8, "本月油耗" => 7),
	);
}
/*只有当前为子公司时可以查询司机
 *$date 选定日期
 *$page 分页页码
 *返回日期内 单位下司机的油耗及其相关信息
 */
function get_all_driver($date, $page) {
//子公司
	return array(
		array(
			array("id" => 1, "司机名" => "司机名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("id" => 2, "司机名" => "司机名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("id" => 3, "司机名" => "司机名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("id" => 4, "司机名" => "司机名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("id" => 5, "司机名" => "司机名", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
		), "count" => 50,
	);
}
/*只有当前为子公司时可以查询车辆
 *$date 选定日期
 *$page 分页页码
 *返回日期内 单位下车辆的油耗及其相关信息
 */
function get_all_car($date, $page) {
//子公司
	return array(
		array(
			array("车牌号" => "车牌号", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("车牌号" => "车牌号", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("车牌号" => "车牌号", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("车牌号" => "车牌号", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
			array("车牌号" => "车牌号", "行驶总里程" => "行驶总里程", "本月行驶里程" => "本月行驶里程", "加油量" => "加油量", "油耗" => "油耗"),
		), "count" => 50,
	);
}

/*
 *$id 司机id
 *$page     array("日期" => "日期", "油耗" => 9, "怠速" => 0.5, "急加速" => 18, "刹车" => 17, "安全危险分数" => 300),
 *返回该司机的油耗统计以及相关信息
 */
function driver_detail_oil($id, $page) {
	return array(
		array(
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 15, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 12, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9.5, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9.8, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9.9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9.3, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 8, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 7, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 6.8, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
		),
		array(
			array("车牌号" => "车牌号", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("车牌号" => "车牌号", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("车牌号" => "车牌号", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("车牌号" => "车牌号", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
		),
		"count" => 50,
	);
}

/*
 *$id 车辆ID
 *$page 对日期翻页 可以查询以前的
 *查询车辆 以及 开车的司机的相关信息
 *返回该车辆的油耗统计以及相关信息
 */
function car_detail_oil($id, $page) {
	return array(
		array(
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
			array("月份" => "月份", "油耗" => 9, "怠速比例" => 0.5, "急加速与急刹车次数" => 35, "危险分数" => 300),
		),
		array(
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
			array("司机" => "司机", "GPS里程" => 779, "ME里程" => 999, "实际里程" => 1111, "加油量" => 10),
		),
		"count" => 50,
	);
}
?>